In [5]:
import os 
import pandas as pd
import numpy as np

In [8]:
from keras.datasets import imdb
import tensorflow as tf

Using TensorFlow backend.

In [9]:
pd.DataFrame(imdb.load_data())

,0,1
0,"[[1, 14, 22, 16, 43, 530, 973, 1622, 1385, 65,...","[1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, ..."
1,"[[1, 591, 202, 14, 31, 6, 717, 10, 10, 18142, ...","[0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, ..."

In [10]:
(train_data, train_labels), (test_data, test_labels) = imdb.load_data()

In [11]:
train_data.shape, train_labels.shape, test_data.shape, test_labels.shape

((25000,), (25000,), (25000,), (25000,))

In [12]:
pd.DataFrame(train_data).head()

                                                   0
0  [1, 14, 22, 16, 43, 530, 973, 1622, 1385, 65, ...
1  [1, 194, 1153, 194, 8255, 78, 228, 5, 6, 1463,...
2  [1, 14, 47, 8, 30, 31, 7, 4, 249, 108, 7, 4, 5...
3  [1, 4, 18609, 16085, 33, 2804, 4, 2040, 432, 1...
4  [1, 249, 1323, 7, 61, 113, 10, 10, 13, 1637, 1...

In [13]:
pd.DataFrame(train_labels).head()

   0
0  1
1  0
2  0
3  1
4  0